number = int(input("შეიყვანეთ რიცხვი: "))

if 5 < number < 15 and number != 10:
    print("რიცხვი 5-სა და 15-ს შორისა, მაგრამ არა 10-ის ტოლი.")
else:
    print("რიცხვი არ შეესაბამება მოთხოვნებს.")
    name = input("შეიყვანეთ სახელი: ")
age = int(input("შეიყვანეთ ასაკი: "))

if age > 18 and name.startswith("A"):
    print("თქვენ აკმაყოფილებთ ყველა მოთხოვნას.")
else:
    print("თქვენ არ აკმაყოფილებთ მოთხოვნებს.")
    number = int(input("შეიყვანეთ რიცხვი: "))

if number % 2 == 0 or number % 3 == 0:
    print("რიცხვი ლუწია ან 3-ის გამყოფი.")
else:
    print("რიცხვი არც ლუწია, არც 3-ის გამყოფი.")
number1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
number2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

if number1 >= 100 or number2 >= 100:
    print("მათი შორის მაინც ერთი რიცხვი 100-ის ტოლი ან მასზე მეტია.")
else:
    print("რიცხვები არც ერთი 100-ის ტოლია, არც მასზე მეტი.")