a = bool(input("შეიყვანეთ პირველი ცვლადი (True ან False): "))
b = bool(input("შეიყვანეთ მეორე ცვლადი (True ან False): "))

if a or b:
    print("ერთ-ერთი ცვლადი მაინც მართალია.")
else:
    print("ორივე ცვლადი არ არის მართალი.")

a = bool(input("შეიყვანეთ პირველი ცვლადი (True ან False): "))
b = bool(input("შეიყვანეთ მეორე ცვლადი (True ან False): "))

if a and b:
    print("ორივე ცვლადი მართალია.")
else:
    print("ერთი ან ორივე ცვლადი არ არის მართალი.")
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

if num1 == num2 or num1 > num2:
    print("პირველი რიცხვი არის ან თანაბარი მეორე რიცხვთან, ან მეტი.")
else:
    print("პირველი რიცხვი არც თანაბარია, არც მეტია.")

age = int(input("შეიყვანეთ ბავშვის ასაკი: "))

if 6 <= age <= 12:
    print("ბავშვი 6-დან 12 წლამდეა.")
else:
    print("ბავშვი არაა 6-დან 12 წლამდე.")
