 #1
birth_year =int(input("შეიყვანე დაბადების წელი:"))
print(birth_year)
# იმიტომ გავაკეთე ინტეჯერათ რომ input-ში გვჭირდებოდა ბრჭყალების გამოყენება 
 #2
username =(input("შეიყვანე შენი სახელი:"))
print("hello," + username + "!")
 #3 

  # არის ორი ან მეტი სტრიქონის ტექსტის რიგის ერთად დაკავშირების პროცესი
 #4
 # integer - მთელი რიცხვები (მაგ: -3, 0, 42)
#  Float - ორჯერადი რიცხვები (მაგ: 3.14, -0.01, 2.718)
#  String - ტექსტი ან ბრჭყალები (მაგ: "გამარჯობა")
#  Boolean - ტყუილი და მართლი True და False
 #4
   #str() სტრ გვაძლევს იმის საშუალებას რომ გადავაქციოთ სტრინგათ მაგ: str(country)
#int() ინტ გვაძლევს იმის საშუალებას რო გადავაქციოთ ინტეჯერათ მაგ: int(heigth)
#float() ფლოუთ გვაძლევს იმის საშუალებას რომ გადავაქციოთ მთელ რიცხვათ მაგ: float(heigth)

